### Guia practica pandas

#### Ejercicio

Se requiere crear un DataFrame desde 0 con tres columnas (a partir de tres listas de n cantidades iguales)

In [2]:
import pandas

lista1=["Comida",200]
lista2=["Luz",500]
lista3=["Telecentro",3000]

gastos=pandas.DataFrame((lista1,lista2,lista3),columns=["Descripcion","Monto"])
gastos

  Descripcion  Monto
0      Comida    200
1         Luz    500
2  Telecentro   3000

####Â Ejercicio 

Dada una lista de listas donde cada lista contiene dos elementos, el primero es el nombre del mercado, el segundo representa el saldo en USD, se solicita crear un dataframe con dicha informacion donde las columnas deben llevar el titulo de Mercado y Saldo la otra.

data = [["NYSE",1300],["BME",2000],["BMV",3000],["BYMA",2340], ["BVC", 4000]]

In [2]:
import pandas
data = [["NYSE",1300],["BME",2000],["BMV",3000],["BYMA",2340], ["BVC", 4000]]

mercado=pandas.DataFrame(data,columns=["Mercado","Saldo"])
mercado

  Mercado  Saldo
0    NYSE   1300
1     BME   2000
2     BMV   3000
3    BYMA   2340
4     BVC   4000

#### Ejercicio

Dado un diccionario con algunos indices y sus respectivas cotizaciones a la fecha se solicita pasarlo a un dataframe

data = {'Indices':['DowJones', 'IBEX35', 'IndiceEuro', 'DAX'], 'Cotizaciones':[26428,6877.40,103.95,2313.36]}

In [4]:
import pandas
data = {'Indices':['DowJones', 'IBEX35', 'IndiceEuro', 'DAX'], 'Cotizaciones':[26428,6877.40,103.95,2313.36]}

mercado=pandas.DataFrame(data)
mercado

      Indices  Cotizaciones
0    DowJones      26428.00
1      IBEX35       6877.40
2  IndiceEuro        103.95
3         DAX       2313.36

#### Ejercicio
Se requiere descargar el excel con cotizaciones de la empresa YPF e importarlo en el entorno de jupyter notebook, el mismo se encuentra en https://drive.google.com/file/d/1yAlN1_6mzP7yb-S51n0xXxqx3it_0bo1/view?usp=sharing
El mismo luego se deberan mostrar las columnas 'timestamp', 'volume', 'high'

In [2]:
import pandas

columnas=["timestamp","volume","high"]

data=pandas.read_excel("YPF.xlsx",usecols=columnas)
data

      timestamp   high   volume
0    2020-04-03   4.60  1236928
1    2020-04-02   4.52  2504579
2    2020-04-01   4.16  1298840
3    2020-03-31   4.40  1419680
4    2020-03-30   4.10  1407649
...         ...    ...      ...
5028 2000-04-07  35.00     9400
5029 2000-04-06  35.13    31200
5030 2000-04-05  34.75     8000
5031 2000-04-04  35.25    25700
5032 2000-04-03  35.44    17800

[5033 rows x 3 columns]

#### Ejercicio 
Se requiere concatenar dos cotizaciones historicas por medio del adj close de dos tickers cualquiera, el "join" debe tener outer y el axis 1

In [6]:
import yfinance
import pandas

data_ads=yfinance.download("ADS",)["Adj Close"]
data_bay=yfinance.download("BAY")["Adj Close"]

data_concatenada=pandas.concat([data_ads,data_bay],join="outer",axis=1)#outer=union axis=1 es columnas
data_concatenada.columns=["Adidas","Bayer"]
data_concatenada.dropna(inplace=True)
data_concatenada

[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed

                Adidas      Bayer
Date
2001-06-15   12.157196   6.700000
2001-06-18   12.393532   6.600000
2001-06-19   12.809486   6.700000
2001-06-20   12.809486   6.600000
2001-06-21   13.121452   6.600000
...                ...        ...
2018-06-22  227.401367  96.769997
2018-06-25  225.594620  96.730003
2018-06-26  223.057480  96.730003
2018-06-27  220.895142  96.730003
2018-06-28  226.382660  94.000000

[3775 rows x 2 columns]

####Â Ejercicio 

    - Se requiere descargar la informacion de un activo X y obtener la suma de 21, 42 y 200 ponerla en el dataframe
    - calcular las bandas de Bollinger para dicho activo
    - Agregar una columna mas que indique true cuando la suma de 21 sea mayor a la de 42 y a la de 200, false en los otros casos.

####Â Ejercicio 
Calculando el dolar CCL, descargar el ultimo mes de cotizacion de GGAL y GGAL.BA y calcula el valor del dolar contado con liquidaciÃ³n, utilizar la columna close para calcularlo, concatenar ambos resultados y agregar dicho valor como una columna extra con el valor del calculo.
La cuenta es GGAL.BA / (GGAL * 10)

In [11]:
import yfinance
import pandas

ggal=yfinance.download("GGAL")["Close"]
ggal_ba=yfinance.download("GGAL.BA")["Close"]

data=pandas.concat([ggal,ggal_ba],join="inner",axis=1)
data.columns=["GGAL","GGAL.BA"]
data["CCL"]=(ggal_ba/ggal)*10
data

[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed

               GGAL     GGAL.BA         CCL
Date
2000-07-26  17.5000    1.730000    0.988571
2000-07-27  17.5000    1.750000    1.000000
2000-07-28  17.3750    1.720000    0.989928
2000-07-31  17.6875    1.750000    0.989399
2000-08-01  17.5000    1.760000    1.005714
...             ...         ...         ...
2020-08-10  12.4400  158.949997  127.773314
2020-08-11  11.8600  154.750000  130.480611
2020-08-12  11.4600  149.350006  130.322867
2020-08-13  11.5300  149.949997  130.052039
2020-08-14  11.3700  145.000000  127.528585

[4844 rows x 3 columns]